{
  "\n": 12, 
  " ": 0, 
  "!": 35, 
  "\"": 41, 
  "#": 19, 
  "%": 82, 
  "&": 67, 
  "'": 48, 
  "(": 57, 
  ")": 58, 
  "*": 121, 
  "+": 83, 
  ",": 21, 
  "-": 73, 
  ".": 18, 
  "/": 89, 
  "0": 39, 
  "1": 45, 
  "2": 49, 
  "3": 56, 
  "4": 59, 
  "5": 55, 
  "6": 68, 
  "7": 62, 
  "8": 70, 
  "9": 72, 
  ":": 38, 
  ";": 69, 
  "=": 153, 
  "?": 46, 
  "@": 53, 
  "A": 26, 
  "B": 47, 
  "C": 34, 
  "D": 40, 
  "E": 30, 
  "F": 50, 
  "G": 43, 
  "H": 71, 
  "I": 22, 
  "J": 95, 
  "K": 92, 
  "L": 28, 
  "M": 37, 
  "N": 32, 
  "O": 29, 
  "P": 36, 
  "Q": 63, 
  "R": 31, 
  "S": 20, 
  "T": 33, 
  "U": 52, 
  "V": 42, 
  "W": 93, 
  "X": 97, 
  "Y": 100, 
  "Z": 61, 
  "[": 128, 
  "]": 138, 
  "^": 275, 
  "_": 84, 
  "a": 2, 
  "b": 23, 
  "c": 10, 
  "d": 11, 
  "e": 3, 
  "f": 27, 
  "g": 16, 
  "h": 25, 
  "i": 1, 
  "j": 99, 
  "k": 75, 
  "l": 8, 
  "m": 13, 
  "n": 5, 
  "o": 4, 
  "p": 15, 
  "q": 44, 
  "r": 6, 
  "s": 9, 
  "t": 7, 
  "u": 14, 
  "v": 17, 
  "w": 81, 
  "x": 76, 
  "y": 80, 
  "z": 24, 
  "|": 104, 
  "\u0092": 187, 
  "\u0093": 150, 
  "\u0094": 151, 
  "\u0096": 169, 
  "\u00a0": 199, 
  "\u00ab": 170, 
  "\u00b0": 103, 
  "\u00b4": 126, 
  "\u00ba": 217, 
  "\u00bb": 196, 
  "\u00c0": 98, 
  "\u00c5": 288, 
  "\u00c8": 91, 
  "\u00c9": 162, 
  "\u00cc": 120, 
  "\u00cd": 160, 
  "\u00d2": 112, 
  "\u00d6": 178, 
  "\u00d9": 114, 
  "\u00da": 220, 
  "\u00dc": 256, 
  "\u00e0": 54, 
  "\u00e1": 133, 
  "\u00e8": 51, 
  "\u00e9": 74, 
  "\u00ea": 223, 
  "\u00ec": 64, 
  "\u00ed": 108, 
  "\u00f2": 65, 
  "\u00f3": 122, 
  "\u00f6": 201, 
  "\u00f9": 66, 
  "\u00fa": 111, 
  "\u00fc": 175, 
  "\u0142": 219, 
  "\u0144": 195, 
  "\u014d": 252, 
  "\u0161": 258, 
  "\u200d": 136, 
  "\u2013": 278, 
  "\u2018": 127, 
  "\u2019": 60, 
  "\u201c": 77, 
  "\u201d": 78, 
  "\u203c": 154, 
  "\u2060": 204, 
  "\u20ac": 101, 
  "\u2139": 190, 
  "\u2600": 117, 
  "\u260e": 240, 
  "\u2611": 276, 
  "\u2614": 235, 
  "\u263a": 115, 
  "\u2640": 212, 
  "\u2642": 140, 
  "\u2665": 273, 
  "\u2666": 242, 
  "\u2695": 265, 
  "\u26a0": 139, 
  "\u26ab": 181, 
  "\u26bd": 269, 
  "\u26d4": 209, 
  "\u2702": 226, 
  "\u2705": 141, 
  "\u270c": 193, 
  "\u2714": 238, 
  "\u2728": 266, 
  "\u274c": 124, 
  "\u274e": 239, 
  "\u2757": 177, 
  "\u2764": 105, 
  "\u27a1": 203, 
  "\u2b55": 254, 
  "\ufe0f": 94, 
  "\ud835\udc6b": 281, 
  "\ud835\udc70": 267, 
  "\ud835\udc74": 250, 
  "\ud835\udc82": 284, 
  "\ud835\udc85": 210, 
  "\ud835\udc86": 173, 
  "\ud835\udc8a": 183, 
  "\ud835\udc8d": 192, 
  "\ud835\udc8f": 185, 
  "\ud835\udc90": 206, 
  "\ud835\udc93": 188, 
  "\ud835\udc94": 283, 
  "\ud835\udc95": 180, 
  "\ud835\udc97": 229, 
  "\ud835\uddd6": 255, 
  "\ud835\udddb": 274, 
  "\ud835\udddc": 221, 
  "\ud835\udde6": 247, 
  "\ud835\udde8": 268, 
  "\ud83c\udde6": 260, 
  "\ud83c\udde7": 176, 
  "\ud83c\udde8": 222, 
  "\ud83c\udde9": 205, 
  "\ud83c\uddea": 174, 
  "\ud83c\uddeb": 168, 
  "\ud83c\uddec": 224, 
  "\ud83c\udded": 165, 
  "\ud83c\uddee": 87, 
  "\ud83c\uddf0": 294, 
  "\ud83c\uddf1": 166, 
  "\ud83c\uddf3": 197, 
  "\ud83c\uddf5": 243, 
  "\ud83c\uddf7": 152, 
  "\ud83c\uddf8": 148, 
  "\ud83c\uddf9": 88, 
  "\ud83c\uddfa": 137, 
  "\ud83c\uddfb": 289, 
  "\ud83c\uddff": 282, 
  "\ud83c\udf1e": 230, 
  "\ud83c\udf36": 233, 
  "\ud83c\udf3e": 237, 
  "\ud83c\udf68": 277, 
  "\ud83c\udf7e": 172, 
  "\ud83c\udf84": 182, 
  "\ud83c\udf85": 227, 
  "\ud83c\udf99": 145, 
  "\ud83c\udfa4": 293, 
  "\ud83c\udfa5": 231, 
  "\ud83c\udfa6": 208, 
  "\ud83c\udfac": 290, 
  "\ud83c\udfc3": 271, 
  "\ud83c\udfd0": 292, 
  "\ud83c\udfd6": 279, 
  "\ud83c\udffb": 102, 
  "\ud83c\udffc": 295, 
  "\ud83d\udc08": 202, 
  "\ud83d\udc2e": 262, 
  "\ud83d\udc36": 184, 
  "\ud83d\udc3e": 270, 
  "\ud83d\udc49": 85, 
  "\ud83d\udc4d": 167, 
  "\ud83d\udc4f": 123, 
  "\ud83d\udc68": 244, 
  "\ud83d\udc69": 280, 
  "\ud83d\udca5": 264, 
  "\ud83d\udcaa": 113, 
  "\ud83d\udcaf": 171, 
  "\ud83d\udcbb": 147, 
  "\ud83d\udccc": 191, 
  "\ud83d\udccd": 155, 
  "\ud83d\udcde": 225, 
  "\ud83d\udce2": 263, 
  "\ud83d\udce3": 241, 
  "\ud83d\udcf2": 149, 
  "\ud83d\udcfa": 86, 
  "\ud83d\udcfb": 110, 
  "\ud83d\udcfd": 198, 
  "\ud83d\udd1d": 157, 
  "\ud83d\udd34": 79, 
  "\ud83d\udd35": 144, 
  "\ud83d\udd3a": 234, 
  "\ud83d\udda4": 215, 
  "\ud83d\uddbc": 291, 
  "\ud83d\udde3": 116, 
  "\ud83d\ude00": 118, 
  "\ud83d\ude01": 96, 
  "\ud83d\ude02": 106, 
  "\ud83d\ude03": 135, 
  "\ud83d\ude04": 131, 
  "\ud83d\ude05": 129, 
  "\ud83d\ude07": 179, 
  "\ud83d\ude09": 109, 
  "\ud83d\ude0a": 90, 
  "\ud83d\ude0b": 119, 
  "\ud83d\ude0d": 156, 
  "\ud83d\ude0e": 132, 
  "\ud83d\ude0f": 272, 
  "\ud83d\ude11": 285, 
  "\ud83d\ude12": 194, 
  "\ud83d\ude13": 248, 
  "\ud83d\ude14": 161, 
  "\ud83d\ude15": 286, 
  "\ud83d\ude18": 107, 
  "\ud83d\ude1e": 211, 
  "\ud83d\ude21": 218, 
  "\ud83d\ude22": 253, 
  "\ud83d\ude29": 232, 
  "\ud83d\ude2c": 200, 
  "\ud83d\ude2e": 158, 
  "\ud83d\ude31": 125, 
  "\ud83d\ude32": 259, 
  "\ud83d\ude33": 164, 
  "\ud83d\ude35": 251, 
  "\ud83d\ude42": 130, 
  "\ud83d\ude43": 246, 
  "\ud83d\ude44": 214, 
  "\ud83d\ude4f": 143, 
  "\ud83d\ude80": 245, 
  "\ud83d\ude82": 257, 
  "\ud83d\ude86": 213, 
  "\ud83d\ude92": 249, 
  "\ud83d\ude93": 228, 
  "\ud83d\ude9c": 207, 
  "\ud83d\udea8": 189, 
  "\ud83d\udeab": 186, 
  "\ud83d\udebf": 236, 
  "\ud83d\uded1": 159, 
  "\ud83e\udd14": 146, 
  "\ud83e\udd17": 287, 
  "\ud83e\udd23": 134, 
  "\ud83e\udd26": 142, 
  "\ud83e\udd33": 163, 
  "\ud83e\udd37": 216, 
  "\ud83e\udd42": 261
}