{
  "\n": 20, 
  "\r": 21, 
  " ": 0, 
  "!": 40, 
  "\"": 52, 
  "#": 22, 
  "%": 91, 
  "&": 85, 
  "'": 56, 
  "(": 76, 
  ")": 78, 
  "*": 123, 
  "+": 92, 
  ",": 26, 
  "-": 86, 
  ".": 16, 
  "/": 15, 
  "0": 41, 
  "1": 46, 
  "2": 48, 
  "3": 54, 
  "4": 57, 
  "5": 55, 
  "6": 62, 
  "7": 59, 
  "8": 63, 
  "9": 64, 
  ":": 23, 
  ";": 84, 
  "=": 155, 
  "?": 53, 
  "@": 68, 
  "A": 29, 
  "B": 47, 
  "C": 37, 
  "D": 42, 
  "E": 33, 
  "F": 50, 
  "G": 44, 
  "H": 65, 
  "I": 25, 
  "J": 77, 
  "K": 72, 
  "L": 32, 
  "M": 39, 
  "N": 35, 
  "O": 31, 
  "P": 38, 
  "Q": 61, 
  "R": 34, 
  "S": 24, 
  "T": 36, 
  "U": 51, 
  "V": 43, 
  "W": 73, 
  "X": 74, 
  "Y": 75, 
  "Z": 60, 
  "[": 129, 
  "]": 140, 
  "^": 278, 
  "_": 93, 
  "a": 2, 
  "b": 27, 
  "c": 10, 
  "d": 12, 
  "e": 4, 
  "f": 30, 
  "g": 17, 
  "h": 19, 
  "i": 1, 
  "j": 79, 
  "k": 67, 
  "l": 8, 
  "m": 13, 
  "n": 6, 
  "o": 3, 
  "p": 11, 
  "q": 45, 
  "r": 7, 
  "s": 9, 
  "t": 5, 
  "u": 14, 
  "v": 18, 
  "w": 71, 
  "x": 66, 
  "y": 70, 
  "z": 28, 
  "|": 106, 
  "\u0092": 190, 
  "\u0093": 152, 
  "\u0094": 153, 
  "\u0096": 172, 
  "\u00a0": 159, 
  "\u00ab": 173, 
  "\u00b0": 105, 
  "\u00b4": 128, 
  "\u00ba": 219, 
  "\u00bb": 199, 
  "\u00c0": 102, 
  "\u00c5": 290, 
  "\u00c8": 99, 
  "\u00c9": 165, 
  "\u00cc": 122, 
  "\u00cd": 163, 
  "\u00d2": 114, 
  "\u00d6": 181, 
  "\u00d9": 116, 
  "\u00da": 222, 
  "\u00dc": 258, 
  "\u00e0": 69, 
  "\u00e1": 135, 
  "\u00e8": 58, 
  "\u00e9": 87, 
  "\u00ea": 225, 
  "\u00ec": 81, 
  "\u00ed": 110, 
  "\u00f2": 82, 
  "\u00f3": 124, 
  "\u00f6": 203, 
  "\u00f9": 83, 
  "\u00fa": 113, 
  "\u00fc": 177, 
  "\u0142": 221, 
  "\u0144": 198, 
  "\u014d": 255, 
  "\u0161": 260, 
  "\u200d": 138, 
  "\u2013": 281, 
  "\u2018": 130, 
  "\u2019": 80, 
  "\u201c": 88, 
  "\u201d": 89, 
  "\u2026": 49, 
  "\u203c": 156, 
  "\u2060": 206, 
  "\u20ac": 104, 
  "\u2139": 194, 
  "\u25b6": 252, 
  "\u2600": 119, 
  "\u260e": 242, 
  "\u2611": 279, 
  "\u2614": 237, 
  "\u263a": 117, 
  "\u2640": 214, 
  "\u2642": 142, 
  "\u2665": 276, 
  "\u2666": 244, 
  "\u2695": 268, 
  "\u26a0": 141, 
  "\u26ab": 184, 
  "\u26bd": 272, 
  "\u26d4": 211, 
  "\u2702": 228, 
  "\u2705": 143, 
  "\u270c": 197, 
  "\u2714": 240, 
  "\u2728": 269, 
  "\u274c": 126, 
  "\u274e": 241, 
  "\u2757": 180, 
  "\u2764": 107, 
  "\u27a1": 205, 
  "\u2b55": 257, 
  "\ufe0f": 100, 
  "\ud835\udc6b": 284, 
  "\ud835\udc70": 270, 
  "\ud835\udc74": 253, 
  "\ud835\udc82": 266, 
  "\ud835\udc85": 212, 
  "\ud835\udc86": 176, 
  "\ud835\udc8a": 186, 
  "\ud835\udc8d": 196, 
  "\ud835\udc8f": 188, 
  "\ud835\udc90": 208, 
  "\ud835\udc93": 192, 
  "\ud835\udc94": 286, 
  "\ud835\udc95": 183, 
  "\ud835\udc97": 231, 
  "\ud835\uddd6": 295, 
  "\ud835\udddb": 277, 
  "\ud835\udddc": 223, 
  "\ud835\udde6": 249, 
  "\ud835\udde8": 271, 
  "\ud83c\udde6": 262, 
  "\ud83c\udde7": 178, 
  "\ud83c\udde8": 224, 
  "\ud83c\udde9": 207, 
  "\ud83c\uddea": 179, 
  "\ud83c\uddeb": 171, 
  "\ud83c\uddec": 226, 
  "\ud83c\udded": 168, 
  "\ud83c\uddee": 96, 
  "\ud83c\uddf0": 297, 
  "\ud83c\uddf1": 169, 
  "\ud83c\uddf3": 200, 
  "\ud83c\uddf5": 245, 
  "\ud83c\uddf7": 154, 
  "\ud83c\uddf8": 150, 
  "\ud83c\uddf9": 97, 
  "\ud83c\uddfa": 139, 
  "\ud83c\uddfb": 291, 
  "\ud83c\uddff": 285, 
  "\ud83c\udf1e": 232, 
  "\ud83c\udf36": 235, 
  "\ud83c\udf3e": 239, 
  "\ud83c\udf68": 280, 
  "\ud83c\udf7e": 175, 
  "\ud83c\udf84": 185, 
  "\ud83c\udf85": 229, 
  "\ud83c\udf99": 147, 
  "\ud83c\udfa4": 296, 
  "\ud83c\udfa5": 233, 
  "\ud83c\udfa6": 210, 
  "\ud83c\udfac": 292, 
  "\ud83c\udfc3": 274, 
  "\ud83c\udfd0": 294, 
  "\ud83c\udfd6": 282, 
  "\ud83c\udffb": 103, 
  "\ud83c\udffc": 298, 
  "\ud83d\udc08": 204, 
  "\ud83d\udc2e": 264, 
  "\ud83d\udc36": 187, 
  "\ud83d\udc3e": 273, 
  "\ud83d\udc49": 94, 
  "\ud83d\udc4d": 170, 
  "\ud83d\udc4f": 125, 
  "\ud83d\udc68": 246, 
  "\ud83d\udc69": 283, 
  "\ud83d\udca5": 267, 
  "\ud83d\udcaa": 115, 
  "\ud83d\udcaf": 174, 
  "\ud83d\udcbb": 149, 
  "\ud83d\udccc": 195, 
  "\ud83d\udccd": 158, 
  "\ud83d\udcde": 227, 
  "\ud83d\udce2": 265, 
  "\ud83d\udce3": 243, 
  "\ud83d\udcf2": 151, 
  "\ud83d\udcfa": 95, 
  "\ud83d\udcfb": 112, 
  "\ud83d\udcfd": 201, 
  "\ud83d\udd1d": 160, 
  "\ud83d\udd34": 90, 
  "\ud83d\udd35": 146, 
  "\ud83d\udd3a": 236, 
  "\ud83d\udda4": 217, 
  "\ud83d\uddbc": 293, 
  "\ud83d\udde3": 118, 
  "\ud83d\ude00": 120, 
  "\ud83d\ude01": 101, 
  "\ud83d\ude02": 108, 
  "\ud83d\ude03": 137, 
  "\ud83d\ude04": 133, 
  "\ud83d\ude05": 131, 
  "\ud83d\ude07": 182, 
  "\ud83d\ude09": 111, 
  "\ud83d\ude0a": 98, 
  "\ud83d\ude0b": 121, 
  "\ud83d\ude0d": 157, 
  "\ud83d\ude0e": 134, 
  "\ud83d\ude0f": 275, 
  "\ud83d\ude11": 287, 
  "\ud83d\ude12": 191, 
  "\ud83d\ude13": 250, 
  "\ud83d\ude14": 164, 
  "\ud83d\ude15": 288, 
  "\ud83d\ude18": 109, 
  "\ud83d\ude1e": 213, 
  "\ud83d\ude21": 220, 
  "\ud83d\ude22": 256, 
  "\ud83d\ude29": 234, 
  "\ud83d\ude2c": 202, 
  "\ud83d\ude2e": 161, 
  "\ud83d\ude31": 127, 
  "\ud83d\ude32": 261, 
  "\ud83d\ude33": 167, 
  "\ud83d\ude35": 254, 
  "\ud83d\ude42": 132, 
  "\ud83d\ude43": 248, 
  "\ud83d\ude44": 216, 
  "\ud83d\ude4f": 145, 
  "\ud83d\ude80": 247, 
  "\ud83d\ude82": 259, 
  "\ud83d\ude86": 215, 
  "\ud83d\ude92": 251, 
  "\ud83d\ude93": 230, 
  "\ud83d\ude9c": 209, 
  "\ud83d\udea8": 193, 
  "\ud83d\udeab": 189, 
  "\ud83d\udebf": 238, 
  "\ud83d\uded1": 162, 
  "\ud83e\udd14": 148, 
  "\ud83e\udd17": 289, 
  "\ud83e\udd23": 136, 
  "\ud83e\udd26": 144, 
  "\ud83e\udd33": 166, 
  "\ud83e\udd37": 218, 
  "\ud83e\udd42": 263
}